In [ ]:
from pyspark.sql import SparkSession

# Initialize Spark session
spark = SparkSession.builder.appName("DataFrame Example").getOrCreate()

----------------------------------------
Exception happened during processing of request from ('127.0.0.1', 64928)
Traceback (most recent call last):
  File "c:\Users\navin\anaconda3\envs\pyspark_env\lib\socketserver.py", line 316, in _handle_request_noblock
    self.process_request(request, client_address)
  File "c:\Users\navin\anaconda3\envs\pyspark_env\lib\socketserver.py", line 347, in process_request
    self.finish_request(request, client_address)
  File "c:\Users\navin\anaconda3\envs\pyspark_env\lib\socketserver.py", line 360, in finish_request
    self.RequestHandlerClass(request, client_address, self)
  File "c:\Users\navin\anaconda3\envs\pyspark_env\lib\socketserver.py", line 747, in __init__
    self.handle()
  File "c:\Users\navin\anaconda3\envs\pyspark_env\lib\site-packages\pyspark\accumulators.py", line 295, in handle
    poll(accum_updates)
  File "c:\Users\navin\anaconda3\envs\pyspark_env\lib\site-packages\pyspark\accumulators.py", line 267, in poll
    if self.rfile in r and func():
  File "c:\Users\navin\anaconda3\envs\pyspark_env\lib\site-packages\pyspark\accumulators.py", line 271, in accum_updates
    num_updates = read_int(self.rfile)
  File "c:\Users\navin\anaconda3\envs\pyspark_env\lib\site-packages\pyspark\serializers.py", line 594, in read_int
    length = stream.read(4)
  File "c:\Users\navin\anaconda3\envs\pyspark_env\lib\socket.py", line 681, in readinto
    return self._sock.recv_into(b)
ConnectionResetError: [WinError 10054] An existing connection was forcibly closed by the remote host
----------------------------------------

In [2]:
data = [("Alice", 34), ("Bob", 45), ("Catherine", 34), ("David", 37), ("Ella", 23)]
columns = ["Name", "Age"]
df = spark.createDataFrame(data, columns)
df.show()

+---------+---+
|     Name|Age|
+---------+---+
|    Alice| 34|
|      Bob| 45|
|Catherine| 34|
|    David| 37|
|     Ella| 23|
+---------+---+

In [20]:
df = spark.read.csv("Employee.csv", header=True, inferSchema=True)
df.show()

+---+-------+----------+------+-----+
| id|   name|department|salary|bonus|
+---+-------+----------+------+-----+
|  1|  Alice|     Sales|  5000|  200|
|  2|    Bob|   Finance|  6000|  300|
|  3|Charlie|     Sales|  5500|  250|
|  4|  David|   Finance|  7000|  400|
|  5|    Eva|        HR|  4500|  150|
|  6|  Frank|        HR|  4800| NULL|
|  7|  Grace|     Sales|  5200|  220|
|  8|   Hank|   Finance|  6500|  350|
+---+-------+----------+------+-----+

In [21]:
df.select("Name", "Salary").show()

+-------+------+
|   Name|Salary|
+-------+------+
|  Alice|  5000|
|    Bob|  6000|
|Charlie|  5500|
|  David|  7000|
|    Eva|  4500|
|  Frank|  4800|
|  Grace|  5200|
|   Hank|  6500|
+-------+------+

In [22]:
df.filter(df["Salary"] > 4000).show()

+---+-------+----------+------+-----+
| id|   name|department|salary|bonus|
+---+-------+----------+------+-----+
|  1|  Alice|     Sales|  5000|  200|
|  2|    Bob|   Finance|  6000|  300|
|  3|Charlie|     Sales|  5500|  250|
|  4|  David|   Finance|  7000|  400|
|  5|    Eva|        HR|  4500|  150|
|  6|  Frank|        HR|  4800| NULL|
|  7|  Grace|     Sales|  5200|  220|
|  8|   Hank|   Finance|  6500|  350|
+---+-------+----------+------+-----+

In [23]:
df.groupBy("Department").count().show()

+----------+-----+
|Department|count|
+----------+-----+
|     Sales|    3|
|        HR|    2|
|   Finance|    3|
+----------+-----+

In [24]:
df.groupBy("Department").agg({"Salary": "avg"}).show()

+----------+-----------------+
|Department|      avg(Salary)|
+----------+-----------------+
|     Sales|5233.333333333333|
|        HR|           4650.0|
|   Finance|           6500.0|
+----------+-----------------+

In [25]:
from pyspark.sql.functions import lit
df.withColumn("Country", lit("USA")).show()

+---+-------+----------+------+-----+-------+
| id|   name|department|salary|bonus|Country|
+---+-------+----------+------+-----+-------+
|  1|  Alice|     Sales|  5000|  200|    USA|
|  2|    Bob|   Finance|  6000|  300|    USA|
|  3|Charlie|     Sales|  5500|  250|    USA|
|  4|  David|   Finance|  7000|  400|    USA|
|  5|    Eva|        HR|  4500|  150|    USA|
|  6|  Frank|        HR|  4800| NULL|    USA|
|  7|  Grace|     Sales|  5200|  220|    USA|
|  8|   Hank|   Finance|  6500|  350|    USA|
+---+-------+----------+------+-----+-------+

In [30]:
df.show()

+---+-------+----------+------+-----+
| id|   name|department|salary|bonus|
+---+-------+----------+------+-----+
|  1|  Alice|     Sales|  5000|  200|
|  2|    Bob|   Finance|  6000|  300|
|  3|Charlie|     Sales|  5500|  250|
|  4|  David|   Finance|  7000|  400|
|  5|    Eva|        HR|  4500|  150|
|  6|  Frank|        HR|  4800| NULL|
|  7|  Grace|     Sales|  5200|  220|
|  8|   Hank|   Finance|  6500|  350|
+---+-------+----------+------+-----+

In [31]:
new_df = spark.createDataFrame([(9, "Sam", "Finance", 4000, "250")], ["Id","Name" , "Department", "Salary", "bonus"])

In [32]:
df = df.union(new_df)
df.show()

+---+-------+----------+------+-----+
| id|   name|department|salary|bonus|
+---+-------+----------+------+-----+
|  1|  Alice|     Sales|  5000|  200|
|  2|    Bob|   Finance|  6000|  300|
|  3|Charlie|     Sales|  5500|  250|
|  4|  David|   Finance|  7000|  400|
|  5|    Eva|        HR|  4500|  150|
|  6|  Frank|        HR|  4800| NULL|
|  7|  Grace|     Sales|  5200|  220|
|  8|   Hank|   Finance|  6500|  350|
|  9|    Sam|   Finance|  4000|  250|
+---+-------+----------+------+-----+

In [33]:
new_df1 = spark.createDataFrame([(9, "Sam", "Finance", 4000, "250")], ["Id","Name" , "Department", "Salary", "bonus"])

In [34]:
df = df.union(new_df1)
df.show()

+---+-------+----------+------+-----+
| id|   name|department|salary|bonus|
+---+-------+----------+------+-----+
|  1|  Alice|     Sales|  5000|  200|
|  2|    Bob|   Finance|  6000|  300|
|  3|Charlie|     Sales|  5500|  250|
|  4|  David|   Finance|  7000|  400|
|  5|    Eva|        HR|  4500|  150|
|  6|  Frank|        HR|  4800| NULL|
|  7|  Grace|     Sales|  5200|  220|
|  8|   Hank|   Finance|  6500|  350|
|  9|    Sam|   Finance|  4000|  250|
|  9|    Sam|   Finance|  4000|  250|
+---+-------+----------+------+-----+

In [35]:
df.dropDuplicates().show()

+---+-------+----------+------+-----+
| id|   name|department|salary|bonus|
+---+-------+----------+------+-----+
|  8|   Hank|   Finance|  6500|  350|
|  5|    Eva|        HR|  4500|  150|
|  3|Charlie|     Sales|  5500|  250|
|  4|  David|   Finance|  7000|  400|
|  2|    Bob|   Finance|  6000|  300|
|  6|  Frank|        HR|  4800| NULL|
|  1|  Alice|     Sales|  5000|  200|
|  7|  Grace|     Sales|  5200|  220|
|  9|    Sam|   Finance|  4000|  250|
+---+-------+----------+------+-----+

In [36]:
df = df.withColumnRenamed("Name", "Employee Name")
df.show()

+---+-------------+----------+------+-----+
| id|Employee Name|department|salary|bonus|
+---+-------------+----------+------+-----+
|  1|        Alice|     Sales|  5000|  200|
|  2|          Bob|   Finance|  6000|  300|
|  3|      Charlie|     Sales|  5500|  250|
|  4|        David|   Finance|  7000|  400|
|  5|          Eva|        HR|  4500|  150|
|  6|        Frank|        HR|  4800| NULL|
|  7|        Grace|     Sales|  5200|  220|
|  8|         Hank|   Finance|  6500|  350|
|  9|          Sam|   Finance|  4000|  250|
|  9|          Sam|   Finance|  4000|  250|
+---+-------------+----------+------+-----+

In [37]:
datadept = [("Finance", "Los Angeles"), ("HR", "San Francisco"), ("Sales", "San Jose")]
columns = ["Department", "Location"]
dept_df = spark.createDataFrame(datadept, columns)
dept_df.show()

+----------+-------------+
|Department|     Location|
+----------+-------------+
|   Finance|  Los Angeles|
|        HR|San Francisco|
|     Sales|     San Jose|
+----------+-------------+

In [39]:
df_join = df.join(dept_df, df.department == dept_df.Department, "inner")
df_join.show()

+---+-------------+----------+------+-----+----------+-------------+
| id|Employee Name|department|salary|bonus|Department|     Location|
+---+-------------+----------+------+-----+----------+-------------+
|  2|          Bob|   Finance|  6000|  300|   Finance|  Los Angeles|
|  4|        David|   Finance|  7000|  400|   Finance|  Los Angeles|
|  8|         Hank|   Finance|  6500|  350|   Finance|  Los Angeles|
|  9|          Sam|   Finance|  4000|  250|   Finance|  Los Angeles|
|  9|          Sam|   Finance|  4000|  250|   Finance|  Los Angeles|
|  5|          Eva|        HR|  4500|  150|        HR|San Francisco|
|  6|        Frank|        HR|  4800| NULL|        HR|San Francisco|
|  1|        Alice|     Sales|  5000|  200|     Sales|     San Jose|
|  3|      Charlie|     Sales|  5500|  250|     Sales|     San Jose|
|  7|        Grace|     Sales|  5200|  220|     Sales|     San Jose|
+---+-------------+----------+------+-----+----------+-------------+